# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

lis = [1, 6, 2, 0, -1, 3]
print(len(set(lis)))
