# 21. Напишите программу для печати всех уникальных значений в словаре.
# {  1:15, 3:4 , 2:2  } -> 4,2

dict_original = {1: 15, 3: 4, 2: 2}
print(set(dict_original.values()))
