# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3

from math import sqrt
s = int(input('Введите сумму чисел: '))
p = int(input('Введите произведение чисел: '))
d = s*s - 4*p
if d > 0:
    y = abs(round((-s + sqrt(abs(d)))/2))
else:
    y = abs(round((-s - sqrt(abs(d)))/2))
x = s - y
print(s, p, "->", x, y)




