# Задача 24:
# В фермерском хозяйстве в Карелии выращивают чернику.
# Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора
# на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед
# некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль, находясь
# перед некоторым кустом заданной во входном списке содержащим
# количество ягод на кустах.


# Input: 2 2 1 3 2
# Output: 7

import random
rows = [random.randint(1, 10) for i in range(0,
        int(input("Введите число кустов N: ")))]
print(*rows)
i = 0
while (i) < len(rows):
    sum = [(rows[i - 1] + rows[i] + rows[i - len(rows) + 1])
           for i in range(0, len(rows))]
    i += 1
    max_index = sum.index(max(sum))
print(max(sum), "\nномер куста c наибольшим числом собранных модулем ягод:",
      max_index+1)
